# Commit Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
IFCTransaction..::..Commit Method
IFCTransaction Class See Also
---
Commits all changes made to the IFC file during the transaction.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public void Commit()
```

Visual Basic
---
```text
Public Sub Commit
```

Visual C++
---
```text
public:
void Commit()
```

# See Also
IFCTransaction Class
Autodesk.Revit.DB.IFC Namespace